/*
    WARNING: Not fully decompiled
    This file is currently not linked into the final dol
*/

#include "spm/animdrv.h"
#include "spm/effdrv.h"
#include "wii/os/OSThread.h"
#include <spm/dvdmgr.h>
#include <spm/filemgr.h>
#include <spm/memory.h>
#include <spm/system.h>
#include <wii/dvd.h>
#include <wii/os.h>
#include <msl/stdarg.h>
#include <msl/stdio.h>
#include <msl/string.h>

extern "C" {

// .bss
static FileWork work;
static char PathBuffer[1024];

// .sdata
static FileWork * afp = &work;

// fileGetWorkPointer inlined, may be needed to match like evtGetWork was

void fileInit()
{
    FileEntry * entry;
    s32 i;

    // Allocate file entry array
    afp->entries = (FileEntry *) __memAlloc(0, sizeof(FileEntry[FILE_ENTRY_MAX]));

    // Initialise allocated linked list
    afp->allocatedStart = NULL;
    afp->allocatedEnd = NULL;

    // Initialise entries
    memset(afp->entries, 0, sizeof(FileEntry[FILE_ENTRY_MAX]));

    // Initialise free linked list
    entry = afp->entries;
    for (i = 0; i < FILE_ENTRY_MAX; i++)
    {
        entry->next = entry + 1;
        entry++;
    }
    afp->freeStart = &afp->entries[0];
    afp->freeEnd = &afp->entries[FILE_ENTRY_MAX - 1];
    afp->freeEnd->next = NULL;
}

void UnpackTexPalette(TPLHeader * palette)
{
    u16 i;

    VALIDATE_TPL_VERSION(0x35, palette);

    if (!IS_TPL_PACKED(palette))
        return;

    // Convert image table offset to pointer
    palette->imageTable = (ImageTableEntry *) (palette->imageTableOffset + (u32) palette);

    // Unpack all images in table
    for (i = 0; i < palette->imageCount; i++)
    {
        if (palette->imageTable[i].imageOffset != 0)
        {
            // Convert image header offset to pointer
            palette->imageTable[i].image = (ImageHeader *) ((u32) palette + palette->imageTable[i].imageOffset);

            if (!palette->imageTable[i].image->unpacked)
            {
                // Convert image data offset to pointer
                palette->imageTable[i].image->data = (void *) ((u32) palette + palette->imageTable[i].image->dataOffset);
                palette->imageTable[i].image->unpacked = true;
            }
        }

        if (palette->imageTable[i].paletteOffset != 0)
        {
            // Convert palette header offset to pointer
            palette->imageTable[i].palette = (PaletteHeader *) ((u32) palette + palette->imageTable[i].paletteOffset);

            if (!palette->imageTable[i].palette->unpacked)
            {
                // Convert palette data offset to pointer
                palette->imageTable[i].palette->data = (void *) ((u32) palette + palette->imageTable[i].palette->dataOffset);
                palette->imageTable[i].palette->unpacked = true;
            }
        }
    }
}

void PackTexPalette(TPLHeader * palette)
{
    u16 i;

    VALIDATE_TPL_VERSION(0x5e, palette);

    if(IS_TPL_PACKED(palette))
        return;

    // Pack all images in table
    for (i = 0; i < palette->imageCount; i++)
    {
        if (palette->imageTable[i].image != NULL)
        {
            if (palette->imageTable[i].image->unpacked)
            {
                palette->imageTable[i].image->unpacked = false;

                // Convert image data pointer to offset
                palette->imageTable[i].image->dataOffset = (u32) palette->imageTable[i].image->data - (u32) palette;
            }

            // Convert image header pointer to offset
            palette->imageTable[i].imageOffset = (u32) palette->imageTable[i].image - (u32) palette;
        }

        if (palette->imageTable[i].palette != NULL)
        {
            if (palette->imageTable[i].palette->unpacked)
            {
                palette->imageTable[i].palette->unpacked = false;

                // Convert palette data pointer to offset
                palette->imageTable[i].palette->dataOffset = (u32) palette->imageTable[i].palette->data - (u32) palette;
            }

            // Convert palette header pointer to offset
            palette->imageTable[i].paletteOffset = (u32) palette->imageTable[i].palette - (u32) palette;
        }
    }
    // Convert image table pointer to offset
    palette->imageTableOffset = (u32) palette->imageTable - (u32) palette;
}

typedef struct {
/* 0x000 */ u8 unknown_0x0[0x14c - 0x0];
/* 0x14C */ u32 unknown_0x14c;
/* 0x150 */ u32 unknown_0x150;
/* 0x154 */ u32 unknown_0x154;
/* 0x158 */ u32 unknown_0x158;
/* 0x15C */ u32 unknown_0x15c;
/* 0x160 */ u32 unknown_0x160;
/* 0x164 */ u32 unknown_0x164;
/* 0x168 */ u32 unknown_0x168;
/* 0x16C */ u32 unknown_0x16c;
/* 0x170 */ u32 unknown_0x170;
/* 0x174 */ u32 unknown_0x174;
/* 0x178 */ u32 unknown_0x178;
/* 0x17C */ u32 unknown_0x17c;
/* 0x180 */ u32 unknown_0x180;
/* 0x184 */ u32 unknown_0x184;
/* 0x188 */ u32 unknown_0x188;
/* 0x18C */ u32 unknown_0x18c;
/* 0x190 */ u32 unknown_0x190;
/* 0x194 */ u32 unknown_0x194;
/* 0x198 */ u32 unknown_0x198;
/* 0x19C */ u32 unknown_0x19c;
/* 0x1A0 */ u32 unknown_0x1a0;
/* 0x1A4 */ u32 unknown_0x1a4;
/* 0x1A8 */ u32 unknown_0x1a8;
/* 0x1AC */ u32 unknown_0x1ac;
    // Unknown total size
} UnkFileData1;

typedef struct {
/* 0x00 */ u8 unknown_0x0[0x24 - 0x0];
/* 0x24 */ u32 unknown_0x24; 
/* 0x28 */ u32 unknown_0x28; 
/* 0x2C */ u32 unknown_0x2c; 
/* 0x30 */ u32 unknown_0x30; 
/* 0x34 */ u32 unknown_0x34; 
/* 0x38 */ u32 unknown_0x38; 
/* 0x3C */ u32 unknown_0x3c; 
/* 0x40 */ u32 unknown_0x40; 
    // Unknown total size
} UnkFileData2;

typedef struct {
/* 0x00 */ u8 unkown_0x0[0x48 - 0x0];
/* 0x48 */ u32 unknown_0x48;
    // Unknown total size
} UnkFileData3;

typedef struct {
/* 0x00 */ u8 unkown_0x0[0x48 - 0x0];
/* 0x48 */ u32 unknown_0x48;
    // Unknown total size
} UnkFileData6;

typedef struct {
/* 0x00 */ u8 unkown_0x0[0x64 - 0x0];
/* 0x64 */ u32 unknown_0x64;
/* 0x68 */ u32 unknown_0x68;
/* 0x6C */ u32 unknown_0x6c;
    // Unknown total size
} UnkFileData7;

typedef struct {
/* 0x000 */ u8 unknown_0x0[0xc8 - 0x0];
/* 0x0c8 */ u32 unknown_0xc8;
/* 0x0cc */ u32 unknown_0xcc;
/* 0x0d0 */ u32 unknown_0xd0;
/* 0x0d4 */ u32 unknown_0xd4;
/* 0x0d8 */ u32 unknown_0xd8;
/* 0x0dc */ u32 unknown_0xdc;
/* 0x0e0 */ u32 unknown_0xe0;
/* 0x0e4 */ u32 unknown_0xe4;
/* 0x0e8 */ u32 unknown_0xe8;
/* 0x0ec */ u32 unknown_0xec;
/* 0x0f0 */ u32 unknown_0xf0;
/* 0x0f4 */ u32 unknown_0xf4;
/* 0x0f8 */ u32 unknown_0xf8;
/* 0x0fc */ u32 unknown_0xfc;
/* 0x100 */ u32 unknown_0x100;
/* 0x104 */ u32 unknown_0x104;
/* 0x108 */ u32 unknown_0x108;
/* 0x10c */ u32 unknown_0x10c;
/* 0x110 */ u32 unknown_0x110;
/* 0x114 */ u32 unknown_0x114;
/* 0x118 */ u32 unknown_0x118;
/* 0x11c */ u32 unknown_0x11c;
/* 0x120 */ u32 unknown_0x120;
    // Unknown total size
} UnkFileData8;

typedef struct {
/* 0x00 */ u8 unknown_0x0[0x58 - 0x0];
/* 0x58 */ u32 unknown_0x58;
/* 0x5c */ u32 unknown_0x5c;
/* 0x60 */ u32 unknown_0x60;
/* 0x64 */ u32 unknown_0x64;
    // Unknown total size
} UnkFileData9;

typedef struct {
/* 0x00 */ u8 unknown_0x0[0x48 - 0x0];
/* 0x48 */ u32 unknown_0x48;
    // Unknown total size
} UnkFileData10;

#define IS_RELOCATED(field, base) ((u32)(field) >= (u32)(base))
#define IS_NOT_RELOCATED(field, base) ((u32)(field) < (u32)(base))
#define APPLY_RELOC(field, base) ((u32)(field) + (u32)(base))
#define CLEAR_RELOC(field, base) ((u32)(field) - (u32)(base))

static void fileGarbageDataAdrClear(FileEntry * entry)
{
    void * data = entry->sp->data;
    switch(entry->fileType)
    {
        case FILETYPE_1:
        {
            UnkFileData1 * unk1 = (UnkFileData1 *)data;
            // Skip if not already relocated
            if (IS_NOT_RELOCATED(unk1->unknown_0x14c, unk1))
                return;

            unk1->unknown_0x14c = CLEAR_RELOC(unk1->unknown_0x14c, unk1);
            unk1->unknown_0x150 = CLEAR_RELOC(unk1->unknown_0x150, unk1);
            unk1->unknown_0x154 = CLEAR_RELOC(unk1->unknown_0x154, unk1);
            unk1->unknown_0x158 = CLEAR_RELOC(unk1->unknown_0x158, unk1);
